In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns

In [2]:
data= pd.read_csv('../data/Murder_victim_age_sex.csv')
data.head()

,Area_Name,Year,Group_Name,Sub_Group_Name,Victims_Above_50_Yrs,Victims_Total,Victims_Upto_10_15_Yrs,Victims_Upto_10_Yrs,Victims_Upto_15_18_Yrs,Victims_Upto_18_30_Yrs,Victims_Upto_30_50_Yrs
0,Andaman & Nicobar Islands,2001,Murder - Female Victims,2. Female Victims,NaN,6,NaN,NaN,NaN,4.0,2.0
1,Andhra Pradesh,2001,Murder - Female Victims,2. Female Victims,67.0,607,15.0,38.0,43.0,269.0,175.0
2,Arunachal Pradesh,2001,Murder - Female Victims,2. Female Victims,2.0,16,0.0,0.0,0.0,10.0,4.0
3,Assam,2001,Murder - Female Victims,2. Female Victims,11.0,128,8.0,4.0,23.0,45.0,37.0
4,Bihar,2001,Murder - Female Victims,2. Female Victims,12.0,366,0.0,0.0,40.0,191.0,123.0

In [3]:
data.shape

(1018, 11)

In [5]:
data.info

<bound method DataFrame.info of                       Area_Name  Year               Group_Name  \
0     Andaman & Nicobar Islands  2001  Murder - Female Victims
1                Andhra Pradesh  2001  Murder - Female Victims
2             Arunachal Pradesh  2001  Murder - Female Victims
3                         Assam  2001  Murder - Female Victims
4                         Bihar  2001  Murder - Female Victims
...                         ...   ...                      ...
1013                 Tamil Nadu  2010   Murder - Total Victims
1014                    Tripura  2010   Murder - Total Victims
1015              Uttar Pradesh  2010   Murder - Total Victims
1016                Uttarakhand  2010   Murder - Total Victims
1017                West Bengal  2010   Murder - Total Victims

         Sub_Group_Name  Victims_Above_50_Yrs  Victims_Total  \
0     2. Female Victims                   NaN              6
1     2. Female Victims                  67.0            607
2     2. Female Victims                   2.0             16
3     2. Female Victims                  11.0            128
4     2. Female Victims                  12.0            366
...                 ...                   ...            ...
1013           3. Total                 327.0           1908
1014           3. Total                  24.0            159
1015           3. Total                 344.0           4456
1016           3. Total                  19.0            176
1017           3. Total                 120.0           2415

      Victims_Upto_10_15_Yrs  Victims_Upto_10_Yrs  Victims_Upto_15_18_Yrs  \
0                        NaN                  NaN                     NaN
1                       15.0                 38.0                    43.0
2                        0.0                  0.0                     0.0
3                        8.0                  4.0                    23.0
4                        0.0                  0.0                    40.0
...                      ...                  ...                     ...
1013                    13.0                 63.0                    16.0
1014                     2.0                  0.0                     0.0
1015                    82.0                138.0                   126.0
1016                     1.0                  NaN                     2.0
1017                     8.0                  2.0                     6.0

      Victims_Upto_18_30_Yrs  Victims_Upto_30_50_Yrs
0                        4.0                     2.0
1                      269.0                   175.0
2                       10.0                     4.0
3                       45.0                    37.0
4                      191.0                   123.0
...                      ...                     ...
1013                   650.0                   839.0
1014                    60.0                    73.0
1015                  2358.0                  1408.0
1016                    91.0                    63.0
1017                  1177.0                  1102.0

[1018 rows x 11 columns]>

In [6]:
data.isnull().sum()

Area_Name                   0
Year                        0
Group_Name                  0
Sub_Group_Name              0
Victims_Above_50_Yrs       56
Victims_Total               0
Victims_Upto_10_15_Yrs    142
Victims_Upto_10_Yrs       118
Victims_Upto_15_18_Yrs    130
Victims_Upto_18_30_Yrs      9
Victims_Upto_30_50_Yrs     11
dtype: int64

In [22]:
data.drop(["Group_Name"],axis = 1, inplace = True)
data.head()

,Area_Name,Year,Sub_Group_Name,Victims_Above_50_Yrs,Victims_Total,Victims_Upto_10_15_Yrs,Victims_Upto_10_Yrs,Victims_Upto_15_18_Yrs,Victims_Upto_18_30_Yrs,Victims_Upto_30_50_Yrs
0,Andaman & Nicobar Islands,2001,2. Female Victims,NaN,6,NaN,NaN,NaN,4.0,2.0
1,Andhra Pradesh,2001,2. Female Victims,67.0,607,15.0,38.0,43.0,269.0,175.0
2,Arunachal Pradesh,2001,2. Female Victims,2.0,16,0.0,0.0,0.0,10.0,4.0
3,Assam,2001,2. Female Victims,11.0,128,8.0,4.0,23.0,45.0,37.0
4,Bihar,2001,2. Female Victims,12.0,366,0.0,0.0,40.0,191.0,123.0

In [23]:
data.shape

(1018, 10)

In [24]:
fin_data = data[data["Sub_Group_Name"]!="3. Total"]
fin_data.head()

,Area_Name,Year,Sub_Group_Name,Victims_Above_50_Yrs,Victims_Total,Victims_Upto_10_15_Yrs,Victims_Upto_10_Yrs,Victims_Upto_15_18_Yrs,Victims_Upto_18_30_Yrs,Victims_Upto_30_50_Yrs
0,Andaman & Nicobar Islands,2001,2. Female Victims,NaN,6,NaN,NaN,NaN,4.0,2.0
1,Andhra Pradesh,2001,2. Female Victims,67.0,607,15.0,38.0,43.0,269.0,175.0
2,Arunachal Pradesh,2001,2. Female Victims,2.0,16,0.0,0.0,0.0,10.0,4.0
3,Assam,2001,2. Female Victims,11.0,128,8.0,4.0,23.0,45.0,37.0
4,Bihar,2001,2. Female Victims,12.0,366,0.0,0.0,40.0,191.0,123.0

In [25]:
fin_data.shape

(676, 10)

In [33]:
fin_data=fin_data.fillna(0)
fin_data.head()

,Area_Name,Year,Sub_Group_Name,Victims_Above_50_Yrs,Victims_Total,Victims_Upto_10_15_Yrs,Victims_Upto_10_Yrs,Victims_Upto_15_18_Yrs,Victims_Upto_18_30_Yrs,Victims_Upto_30_50_Yrs
0,Andaman & Nicobar Islands,2001,2. Female Victims,0.0,6,0.0,0.0,0.0,4.0,2.0
1,Andhra Pradesh,2001,2. Female Victims,67.0,607,15.0,38.0,43.0,269.0,175.0
2,Arunachal Pradesh,2001,2. Female Victims,2.0,16,0.0,0.0,0.0,10.0,4.0
3,Assam,2001,2. Female Victims,11.0,128,8.0,4.0,23.0,45.0,37.0
4,Bihar,2001,2. Female Victims,12.0,366,0.0,0.0,40.0,191.0,123.0

In [39]:
datakeys=['Area_Name','Sub_Group_Name']
for i in datakeys:
    print(i, fin_data[i].unique())

Area_Name ['Andaman & Nicobar Islands' 'Andhra Pradesh' 'Arunachal Pradesh' 'Assam'
 'Bihar' 'Chandigarh' 'Chhattisgarh' 'Delhi' 'Goa' 'Gujarat' 'Haryana'
 'Himachal Pradesh' 'Jammu & Kashmir' 'Jharkhand' 'Karnataka' 'Kerala'
 'Lakshadweep' 'Madhya Pradesh' 'Maharashtra' 'Manipur' 'Meghalaya'
 'Mizoram' 'Nagaland' 'Odisha' 'Puducherry' 'Punjab' 'Rajasthan' 'Sikkim'
 'Tamil Nadu' 'Tripura' 'Uttar Pradesh' 'Uttarakhand' 'West Bengal'
 'Dadra & Nagar Haveli' 'Daman & Diu']
Sub_Group_Name ['2. Female Victims' '1. Male Victims']

In [40]:
from sklearn.preprocessing import LabelEncoder
a=LabelEncoder()
for i in datakeys:
    fin_data[i]=a.fit_transform(fin_data[i])
fin_data.head()

,Area_Name,Year,Sub_Group_Name,Victims_Above_50_Yrs,Victims_Total,Victims_Upto_10_15_Yrs,Victims_Upto_10_Yrs,Victims_Upto_15_18_Yrs,Victims_Upto_18_30_Yrs,Victims_Upto_30_50_Yrs
0,0,2001,1,0.0,6,0.0,0.0,0.0,4.0,2.0
1,1,2001,1,67.0,607,15.0,38.0,43.0,269.0,175.0
2,2,2001,1,2.0,16,0.0,0.0,0.0,10.0,4.0
3,3,2001,1,11.0,128,8.0,4.0,23.0,45.0,37.0
4,4,2001,1,12.0,366,0.0,0.0,40.0,191.0,123.0

In [41]:
fin_data.to_csv("../data/final_murderdataset.csv")